nova/DATA/sow/fio_output_16G
test: (g=0): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1 fio-3.32 Starting 1 process test: Laying out IO file (1 file / 4096MiB) test: (groupid=0, jobs=1): err= 0: pid=3097267: Mon Oct 14 19:04:59 2024 write: IOPS=149k, BW=583MiB/s (611MB/s)(4096MiB/7031msec); 0 zone resets clat (usec): min=3, max=7717, avg= 6.52, stdev=57.10 lat (usec): min=3, max=7717, avg= 6.56, stdev=57.10 clat percentiles (nsec): | 1.00th=[ 4128], 5.00th=[ 4320], 10.00th=[ 4448], 20.00th=[ 4640], | 30.00th=[ 4768], 40.00th=[ 4960], 50.00th=[ 5216], 60.00th=[ 5920], | 70.00th=[ 7072], 80.00th=[ 7776], 90.00th=[ 8256], 95.00th=[ 8768], | 99.00th=[10816], 99.50th=[11712], 99.90th=[22912], 99.95th=[24192], | 99.99th=[26752] bw ( KiB/s): min=579792, max=609040, per=100.00%, avg=597266.29, stdev=7851.28, samples=14 iops : min=144948, max=152260, avg=149316.57, stdev=1962.99, samples=14 lat (usec) : 4=0.25%, 10=96.89%, 20=2.63%, 50=0.23%, 100=0.01% lat (msec) : 10=0.01% cpu : usr=4.14%, sys=95.80%, ctx=3, majf=0, minf=13 IO depths : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0% submit : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0% complete : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0% issued rwts: total=0,1048576,0,0 short=0,0,0,0 dropped=0,0,0,0 latency : target=0, window=0, percentile=100.00%, depth=1 Run status group 0 (all jobs): WRITE: bw=583MiB/s (611MB/s), 583MiB/s-583MiB/s (611MB/s-611MB/s), io=4096MiB (4295MB), run=7031-7031msec Disk stats (read/write): pmem0: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%