nova/DATA/sow/fio_output_2G
test: (g=0): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1 fio-3.32 Starting 1 process test: Laying out IO file (1 file / 512MiB) test: (groupid=0, jobs=1): err= 0: pid=3091133: Mon Oct 14 19:04:32 2024 write: IOPS=152k, BW=595MiB/s (624MB/s)(512MiB/860msec); 0 zone resets clat (usec): min=3, max=1378, avg= 6.33, stdev=10.58 lat (usec): min=3, max=1379, avg= 6.36, stdev=10.59 clat percentiles (nsec): | 1.00th=[ 4256], 5.00th=[ 4512], 10.00th=[ 4640], 20.00th=[ 4832], | 30.00th=[ 5088], 40.00th=[ 5280], 50.00th=[ 5792], 60.00th=[ 6368], | 70.00th=[ 6880], 80.00th=[ 7584], 90.00th=[ 8256], 95.00th=[ 8896], | 99.00th=[10816], 99.50th=[16512], 99.90th=[23168], 99.95th=[24448], | 99.99th=[27520] bw ( KiB/s): min=606000, max=606000, per=99.40%, avg=606000.00, stdev= 0.00, samples=1 iops : min=151500, max=151500, avg=151500.00, stdev= 0.00, samples=1 lat (usec) : 4=0.03%, 10=97.65%, 20=2.03%, 50=0.29%, 100=0.01% lat (msec) : 2=0.01% cpu : usr=7.80%, sys=91.97%, ctx=2, majf=0, minf=13 IO depths : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0% submit : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0% complete : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0% issued rwts: total=0,131072,0,0 short=0,0,0,0 dropped=0,0,0,0 latency : target=0, window=0, percentile=100.00%, depth=1 Run status group 0 (all jobs): WRITE: bw=595MiB/s (624MB/s), 595MiB/s-595MiB/s (624MB/s-624MB/s), io=512MiB (537MB), run=860-860msec Disk stats (read/write): pmem0: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%