nova/DATA/sow/fio_output_4G
test: (g=0): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1 fio-3.32 Starting 1 process test: Laying out IO file (1 file / 1024MiB) test: (groupid=0, jobs=1): err= 0: pid=3092688: Mon Oct 14 19:04:37 2024 write: IOPS=153k, BW=598MiB/s (627MB/s)(1024MiB/1713msec); 0 zone resets clat (usec): min=3, max=2299, avg= 6.35, stdev=16.26 lat (usec): min=3, max=2299, avg= 6.38, stdev=16.26 clat percentiles (nsec): | 1.00th=[ 4192], 5.00th=[ 4448], 10.00th=[ 4640], 20.00th=[ 4896], | 30.00th=[ 5152], 40.00th=[ 5664], 50.00th=[ 6176], 60.00th=[ 6432], | 70.00th=[ 6688], 80.00th=[ 7136], 90.00th=[ 8096], 95.00th=[ 8768], | 99.00th=[ 9920], 99.50th=[14528], 99.90th=[22912], 99.95th=[24192], | 99.99th=[26496] bw ( KiB/s): min=605784, max=617192, per=100.00%, avg=612850.67, stdev=6173.02, samples=3 iops : min=151446, max=154298, avg=153212.67, stdev=1543.26, samples=3 lat (usec) : 4=0.08%, 10=98.97%, 20=0.69%, 50=0.25%, 100=0.01% lat (msec) : 2=0.01%, 4=0.01% cpu : usr=6.02%, sys=93.81%, ctx=2, majf=0, minf=13 IO depths : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0% submit : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0% complete : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0% issued rwts: total=0,262144,0,0 short=0,0,0,0 dropped=0,0,0,0 latency : target=0, window=0, percentile=100.00%, depth=1 Run status group 0 (all jobs): WRITE: bw=598MiB/s (627MB/s), 598MiB/s-598MiB/s (627MB/s-627MB/s), io=1024MiB (1074MB), run=1713-1713msec Disk stats (read/write): pmem0: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%