nova/DATA/sow/fio_output_64G
test: (g=0): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1 fio-3.32 Starting 1 process test: Laying out IO file (1 file / 16384MiB) test: (groupid=0, jobs=1): err= 0: pid=3102745: Mon Oct 14 19:06:22 2024 write: IOPS=122k, BW=479MiB/s (502MB/s)(16.0GiB/34240msec); 0 zone resets clat (usec): min=3, max=29757, avg= 7.99, stdev=225.43 lat (usec): min=3, max=29757, avg= 8.02, stdev=225.43 clat percentiles (nsec): | 1.00th=[ 4192], 5.00th=[ 4448], 10.00th=[ 4576], 20.00th=[ 4768], | 30.00th=[ 4960], 40.00th=[ 5152], 50.00th=[ 5536], 60.00th=[ 6368], | 70.00th=[ 6944], 80.00th=[ 7776], 90.00th=[ 8384], 95.00th=[ 9024], | 99.00th=[10816], 99.50th=[14400], 99.90th=[22912], 99.95th=[24192], | 99.99th=[27008] bw ( KiB/s): min=464632, max=516096, per=100.00%, avg=490463.88, stdev=13274.40, samples=68 iops : min=116158, max=129024, avg=122615.97, stdev=3318.65, samples=68 lat (usec) : 4=0.09%, 10=97.42%, 20=2.23%, 50=0.25%, 100=0.01% lat (msec) : 50=0.01% cpu : usr=3.31%, sys=96.65%, ctx=10, majf=0, minf=13 IO depths : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0% submit : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0% complete : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0% issued rwts: total=0,4194304,0,0 short=0,0,0,0 dropped=0,0,0,0 latency : target=0, window=0, percentile=100.00%, depth=1 Run status group 0 (all jobs): WRITE: bw=479MiB/s (502MB/s), 479MiB/s-479MiB/s (502MB/s-502MB/s), io=16.0GiB (17.2GB), run=34240-34240msec Disk stats (read/write): pmem0: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%