nova/DATA/sow/fio_output_8G
test: (g=0): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1 fio-3.32 Starting 1 process test: Laying out IO file (1 file / 2048MiB) test: (groupid=0, jobs=1): err= 0: pid=3094813: Mon Oct 14 19:04:45 2024 write: IOPS=152k, BW=593MiB/s (622MB/s)(2048MiB/3455msec); 0 zone resets clat (usec): min=3, max=4018, avg= 6.39, stdev=29.99 lat (usec): min=3, max=4019, avg= 6.42, stdev=29.99 clat percentiles (nsec): | 1.00th=[ 4128], 5.00th=[ 4384], 10.00th=[ 4576], 20.00th=[ 4832], | 30.00th=[ 5088], 40.00th=[ 5664], 50.00th=[ 6112], 60.00th=[ 6368], | 70.00th=[ 6624], 80.00th=[ 7008], 90.00th=[ 7904], 95.00th=[ 8640], | 99.00th=[ 9664], 99.50th=[13632], 99.90th=[22656], 99.95th=[23680], | 99.99th=[25984] bw ( KiB/s): min=603120, max=615528, per=100.00%, avg=608897.33, stdev=5141.78, samples=6 iops : min=150780, max=153882, avg=152224.33, stdev=1285.45, samples=6 lat (usec) : 4=0.19%, 10=99.10%, 20=0.46%, 50=0.24%, 100=0.01% lat (msec) : 4=0.01%, 10=0.01% cpu : usr=4.95%, sys=94.99%, ctx=3, majf=0, minf=13 IO depths : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0% submit : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0% complete : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0% issued rwts: total=0,524288,0,0 short=0,0,0,0 dropped=0,0,0,0 latency : target=0, window=0, percentile=100.00%, depth=1 Run status group 0 (all jobs): WRITE: bw=593MiB/s (622MB/s), 593MiB/s-593MiB/s (622MB/s-622MB/s), io=2048MiB (2147MB), run=3455-3455msec Disk stats (read/write): pmem0: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%